# CannotCreateStairForLevelOverlapping Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotCreateStairForLevelOverlapping Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Some of the multistory stairs couldn't be created due to the overlapped levels.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateStairForLevelOverlapping { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateStairForLevelOverlapping As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateStairForLevelOverlapping {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace